{
    "es": {
        "logo": "Guillermo Ramos",
        "nav-inicio": "Inicio",
        "nav-sobremi": "Sobre Mí",
        "nav-habilidades": "Habilidades",
        "nav-proyectos": "Proyectos",
        "nav-certificaciones": "Certificaciones",
        "nav-contacto": "Contacto",
        "sr-abrir-menu": "Abrir menú principal",
        "titulo-principal": "DEVELOPER",
        "subtitulo-principal": "Luis Guillermo Ramos Díaz",
        "carrera": "Ingeniería en Tecnologías de la Información e Innovación Digital",
        "cta-proyectos": "Ver Proyectos",
        "cta-contacto": "Contactar",
        "pie-foto-perfil": "Fotografía profesional.",
        "titulo-sobremi": "Sobre Mí",
        "desc-sobremi-1": "Soy Luis Guillermo, un apasionado desarrollador y estudiante de cuarto cuatrimestre de Ingeniería en Tecnologías de la Información e Innovación Digital en la Universidad Politécnica de Sinaloa. Mi enfoque es crear soluciones de software eficientes, escalables y visualmente atractivas, transformando ideas complejas en aplicaciones funcionales que resuelven problemas reales.",
        "desc-sobremi-2": "Con una base sólida en fundamentos de la ingeniería de software y experiencia en desarrollo, aprendo y me adapto constantemente a las nuevas tecnologías. Mi objetivo es colaborar en proyectos desafiantes y seguir creciendo profesionalmente en el dinámico mundo del software.",
        "cta-cv": "Descargar CV (PDF)",
        "titulo-habilidades": "Habilidades Técnicas",
        "desc-habilidades": "Mi conjunto de herramientas para construir y desplegar aplicaciones. Organizado por categorías.",
        "tab-lenguajes": "Lenguajes",
        "tab-frontend": "Frontend",
        "tab-backend": "Backend",
        "tab-herramientas": "Herramientas",
        "titulo-proyectos": "Proyectos Principales",
        "desc-proyectos": "Una selección de proyectos académicos que demuestran mis habilidades en acción.",
        "p1-titulo": "Sitio Web: Grupo Frontera",
        "p1-desc": "Una página web estática, totalmente responsiva y visualmente atractiva dedicada al grupo musical \"Grupo Frontera\". El sitio presenta información completa sobre la banda, incluyendo su historia, una sección de discografía detallada y un apartado interactivo de integrantes. Se utilizó JavaScript puro para implementar ventanas modales dinámicas que muestran la biografía de cada miembro, todo dentro de un diseño moderno y cohesivo.",
        "p1-rol": "Proyecto Personal",
        "p2-rol": "Proyecto de Equipo (NASA Challenge)",
        "p3-rol": "Proyecto de Equipo (Académico)",
        "p2-titulo": "AstroCast (Guía Climática)",
        "p2-desc": "Asistente web de planificación climática para el \"NASA Space Apps Challenge\". Analiza datos históricos de la API GPM/IMERG de la NASA para calcular la probabilidad de condiciones climatológicas en una fecha y lugar específicos. Mis contribuciones clave incluyeron el consumo de la API, el desarrollo del backend para el procesamiento de datos y la implementación del frontend para su visualización interactiva.",
        "p3-titulo": "MyCECU (Gestión de Expedientes)",
        "p3-desc": "Aplicación de escritorio para la administración integral de expedientes clínicos. El sistema maneja el registro, búsqueda y gestión de pacientes, facilitando el seguimiento médico. Fui responsable del desarrollo de la capa de Vista (View) en el patrón MVC, diseñando e implementando todas las interfaces de usuario y formularios. Además, contribuí activamente en la lógica del Controlador (Controller) para gestionar las interacciones del usuario.",
        "p-enlace-demo": "Demo",
        "p-enlace-codigo": "Código",
        "titulo-certificaciones": "Certificaciones y Reconocimientos",
        "desc-certificaciones": "Validación de conocimientos y participación en eventos relevantes.",
        "c1-caption": "Descripción del Certificado 1 (Placeholder)",
        "c2-caption": "Descripción del Certificado 2 (Placeholder)",
        "c3-caption": "Descripción del Certificado 3 (Placeholder)",
        "c4-caption": "Descripción del Reconocimiento 4 (Placeholder)",
        "footer-titulo-contacto": "Hablemos",
        "footer-desc": "Siempre estoy abierto a oportunidades. Si tienes alguna pregunta o un proyecto en mente, no dudes en escribirme.",
        "footer-contactame": "Contáctame:",
        "cta-copiar-correo": "Copiar Correo",
        "footer-nav": "Navegación",
        "footer-enlaces": "Enlaces",
        "footer-copyright": "© 2024 Luis Guillermo Ramos Díaz. Todos los derechos reservados.",
        "notif-copiado": "¡Correo copiado al portapapeles!"
    },
    "en": {
        "logo": "Guillermo Ramos",
        "nav-inicio": "Home",
        "nav-sobremi": "About Me",
        "nav-habilidades": "Skills",
        "nav-proyectos": "Projects",
        "nav-certificaciones": "Certifications",
        "nav-contacto": "Contact",
        "sr-abrir-menu": "Open main menu",
        "titulo-principal": "DEVELOPER",
        "subtitulo-principal": "Luis Guillermo Ramos Díaz",
        "carrera": "Information Technology and Digital Innovation Engineering",
        "cta-proyectos": "View Projects",
        "cta-contacto": "Contact",
        "pie-foto-perfil": "Professional photograph.",
        "titulo-sobremi": "About Me",
        "desc-sobremi-1": "I'm Luis Guillermo, a passionate developer and a fourth-trimester student of Information Technology and Digital Innovation Engineering at the Polytechnic University of Sinaloa. My focus is on creating efficient, scalable, and visually appealing software solutions, turning complex ideas into functional applications that solve real-world problems.",
        "desc-sobremi-2": "With a solid foundation in software engineering fundamentals and development experience, I am constantly learning and adapting to new technologies. My goal is to collaborate on challenging projects and continue to grow professionally in the dynamic world of software.",
        "cta-cv": "Download CV (PDF)",
        "titulo-habilidades": "Technical Skills",
        "desc-habilidades": "My toolkit for building and deploying applications. Organized by category.",
        "tab-lenguajes": "Languages",
        "tab-frontend": "Frontend",
        "tab-backend": "Backend",
        "tab-herramientas": "Tools",
        "titulo-proyectos": "Main Projects",
        "desc-proyectos": "A selection of academic projects that demonstrate my skills in action.",
        "p1-titulo": "Website: Grupo Frontera",
        "p1-desc": "A static and visually appealing website dedicated to the music group \"Grupo Frontera\". The site features comprehensive information about the band, including their history, a detailed discography section, and an interactive members section. Pure JavaScript was used to implement dynamic modal windows that display each member's biography, all within a modern and cohesive design.",
        "p1-rol": "Personal Project",
        "p2-rol": "Team Project (NASA Challenge)",
        "p3-rol": "Team Project (Academic)",
        "p2-titulo": "AstroCast (Climate Guide)",
        "p2-desc": "A web-based climate planning assistant for the \"NASA Space Apps Challenge\". It analyzes historical data from NASA's GPM/IMERG API to calculate the probability of weather conditions for a specific date and location. My key contributions included API consumption, backend development for data processing, and frontend implementation for interactive visualization.",
        "p3-titulo": "MyCECU (Record Management)",
        "p3-desc": "A desktop application for the comprehensive management of clinical records. The system handles patient registration, search, and management, facilitating medical follow-up. I was responsible for developing the View layer in the MVC pattern, designing and implementing all user interfaces and forms. Additionally, I actively contributed to the Controller logic to manage user interactions.",
        "p-enlace-demo": "Demo",
        "p-enlace-codigo": "Code",
        "titulo-certificaciones": "Certifications & Recognitions",
        "desc-certificaciones": "Knowledge validation and participation in relevant events.",
        "c1-caption": "Certificate 1 Description (Placeholder)",
        "c2-caption": "Certificate 2 Description (Placeholder)",
        "c3-caption": "Certificate 3 Description (Placeholder)",
        "c4-caption": "Recognition 4 Description (Placeholder)",
        "footer-titulo-contacto": "Let's Talk",
        "footer-desc": "I'm always open to opportunities. If you have a question or a project in mind, feel free to reach out.",
        "footer-contactame": "Contact me:",
        "cta-copiar-correo": "Copy Email",
        "footer-nav": "Navigation",
        "footer-enlaces": "Links",
        "footer-copyright": "© 2024 Luis Guillermo Ramos Díaz. All rights reserved.",
        "notif-copiado": "Email copied to clipboard!"
    },
    "fr": {
        "logo": "Guillermo Ramos",
        "nav-inicio": "Accueil",
        "nav-sobremi": "À Propos",
        "nav-habilidades": "Compétences",
        "nav-proyectos": "Projets",
        "nav-certificaciones": "Certifications",
        "nav-contacto": "Contact",
        "sr-abrir-menu": "Ouvrir le menu principal",
        "titulo-principal": "DÉVELOPPEUR",
        "subtitulo-principal": "Luis Guillermo Ramos Díaz",
        "carrera": "Ingénierie des Technologies de l'Information et de l'Innovation Numérique",
        "cta-proyectos": "Voir les Projets",
        "cta-contacto": "Contacter",
        "pie-foto-perfil": "Photographie professionnelle.",
        "titulo-sobremi": "À Propos de Moi",
        "desc-sobremi-1": "Je suis Luis Guillermo, un développeur passionné et étudiant en quatrième trimestre d'Ingénierie des Technologies de l'Information et de l'Innovation Numérique à l'Université Polytechnique de Sinaloa. Je me concentre sur la création de solutions logicielles efficaces, évolutives et visuellement attrayantes, transformant des idées complexes en applications fonctionnelles qui résolvent de vrais problèmes.",
        "desc-sobremi-2": "Avec une base solide en principes fondamentaux du génie logiciel et une expérience en développement, j'apprends et m'adapte constamment aux nouvelles technologies. Mon but est de collaborer sur des projets stimulants et de continuer à grandir professionnellement dans le monde dynamique du logiciel.",
        "cta-cv": "Télécharger le CV (PDF)",
        "titulo-habilidades": "Compétences Techniques",
        "desc-habilidades": "Ma boîte à outils pour construire et déployer des applications. Organisée par catégorie.",
        "tab-lenguajes": "Langages",
        "tab-frontend": "Frontend",
        "tab-backend": "Backend",
        "tab-herramientas": "Outils",
        "titulo-proyectos": "Projets Principaux",
        "desc-proyectos": "Une sélection de projets académiques qui démontrent mes compétences en action.",
        "p1-titulo": "Site Web : Grupo Frontera",
        "p1-desc": "Un site web statique et visuellement attrayant dédié au groupe de musique \"Grupo Frontera\". Le site présente des informations complètes sur le groupe, y compris son histoire, une section de discographie détaillée et une section interactive des membres. Du JavaScript pur a été utilisé pour implémenter des fenêtres modales dynamiques qui affichent la biographie de chaque membre, le tout dans un design moderne et cohérent.",
        "p1-rol": "Projet Personnel",
        "p2-rol": "Projet d'Équipe (NASA Challenge)",
        "p3-rol": "Projet d'Équipe (Académique)",
        "p2-titulo": "AstroCast (Guide Climatique)",
        "p2-desc": "Assistant web de planification climatique pour le \"NASA Space Apps Challenge\". Il analyse les données historiques de l'API GPM/IMERG de la NASA pour calculer la probabilité de conditions météorologiques pour une date et un lieu spécifiques. Mes contributions clés comprenaient la consommation de l'API, le développement du backend pour le traitement des données et l'implémentation du frontend pour la visualisation interactive.",
        "p3-titulo": "MyCECU (Gestion de Dossiers)",
        "p3-desc": "Application de bureau pour la gestion complète des dossiers cliniques. Le système gère l'enregistrement, la recherche et la gestion des patients, facilitant le suivi médical. J'étais responsable du développement de la couche Vue (View) dans le modèle MVC, en concevant et en implémentant toutes les interfaces utilisateur et les formulaires. De plus, j'ai activement contribué à la logique du Contrôleur (Controller) pour gérer les interactions utilisateur.",
        "p-enlace-demo": "Démo",
        "p-enlace-codigo": "Code",
        "titulo-certificaciones": "Certifications et Reconnaissances",
        "desc-certificaciones": "Validation des connaissances et participation à des événements pertinents.",
        "c1-caption": "Description du Certificat 1 (Placeholder)",
        "c2-caption": "Description du Certificat 2 (Placeholder)",
        "c3-caption": "Description du Certificat 3 (Placeholder)",
        "c4-caption": "Description de la Reconnaissance 4 (Placeholder)",
        "footer-titulo-contacto": "Parlons",
        "footer-desc": "Je suis toujours ouvert aux opportunités. Si vous avez une question ou un projet en tête, n'hésitez pas à m'écrire.",
        "footer-contactame": "Contactez-moi :",
        "cta-copiar-correo": "Copier l'Email",
        "footer-nav": "Navigation",
        "footer-enlaces": "Liens",
        "footer-copyright": "© 2024 Luis Guillermo Ramos Díaz. Tous droits réservés.",
        "notif-copiado": "Email copié dans le presse-papiers !"
    }
}